//Задача 8: Напишите программу, которая на вход принимает число (N),
// а на выходе показывает все чётные числа от 1 до N

Console.WriteLine("В условие задачи четные числа должны быть больше 1, введите любое число больше 1");

int number ,<=1;

while (number == 2+1);

{
    if
}
 
    